export const authValidationMessages = {
    USERNAME_ALREADY_EXISTS:
        'Логин существует, пожалуйста, попробуйте другой.',
    EMAIL_ALREADY_EXISTS: 'Почта существует, пожалуйста, попробуйте другую.',
    USERNAME_NOT_FOUND: 'Логин не найден, пожалуйста, попробуйте другой или создайте аккаунт.',
    INCORRECT_PASSWORD: 'Неправильный пароль.',
    USER_IS_BANNED: 'Пользователь заблокирован.',
    PASSWORDS_NOT_MATCH: 'Пароли не совпадают.',
    INVALID_LENGTH: {
        USERNAME:
            'Неправильная длина логина. Длина от 5 до 30 символов.',
        DISPLAY_NAME:
            'Неправильная длина имени. Длина от 1 до 30 символов.',
        PASSWORD:
            'Длина пароля недостаточна. Минимум 8 символов.'
    },
    REGEXP_MISMATCH: {
        USERNAME:
            "Неправильный формат логина. Может состоять только из латинских букв, цифр и символов: '.', '_', '-'",
        PASSWORD:
            "Неправильный формат пароля. Может состоять только из латинских букв, цифр и символов: '.', '@', '_', '-'"
    }
};
